kodezine/NUCLEO-STM32G431RB-MC/demo/__startup/__vectors.c
/* ToDo: Add Cortex exception vectors according the used Cortex-Core */
extern const VECTOR_TABLE_Type __VECTOR_TABLE[256];
const VECTOR_TABLE_Type __VECTOR_TABLE[256] __VECTOR_TABLE_ATTRIBUTE = {
    (VECTOR_TABLE_Type)(&__INITIAL_SP),                         /*     Initial Stack Pointer */
    (VECTOR_TABLE_Type)&NMI_Handler                                                          ,
    (VECTOR_TABLE_Type)&HardFault_Handler                                                    ,
    (VECTOR_TABLE_Type)&MemManage_Handler                                                    ,
    (VECTOR_TABLE_Type)&BusFault_Handler                                                     ,
    (VECTOR_TABLE_Type)&UsageFault_Handler                                                   ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&SVC_Handler                                                          ,
    (VECTOR_TABLE_Type)&DebugMon_Handler                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&PendSV_Handler                                                       ,
    (VECTOR_TABLE_Type)&SysTick_Handler                                                      ,
    (VECTOR_TABLE_Type)&WWDG_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&PVD_PVM_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&RTC_TAMP_LSECSS_IRQHandler                                           ,
    (VECTOR_TABLE_Type)&RTC_WKUP_IRQHandler                                                  ,
    (VECTOR_TABLE_Type)&FLASH_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&RCC_IRQHandler                                                       ,
    (VECTOR_TABLE_Type)&EXTI0_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&EXTI1_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&EXTI2_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&EXTI3_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&EXTIr_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&DMA1_Channel1_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA1_Channel2_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA1_Channel3_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA1_Channel4_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA1_Channel5_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA1_Channel6_IRQHandler                                             ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&ADC1_2_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&USB_HP_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&USB_LP_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&FDCAN1_IT0_IRQHandler                                                ,
    (VECTOR_TABLE_Type)&FDCAN1_IT1_IRQHandler                                                ,
    (VECTOR_TABLE_Type)&EXTI9_5_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&TIM1_BRK_TIM15_IRQHandler                                            ,
    (VECTOR_TABLE_Type)&TIM1_UP_TIM16_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&TIM1_TRG_COM_TIM17_IRQHandler                                        ,
    (VECTOR_TABLE_Type)&TIM1_CC_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&TIM2_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&TIM3_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&TIM4_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&I2C1_EV_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&I2C1_ER_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&I2C2_EV_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&I2C2_ER_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&SPI1_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&SPI2_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&USART1_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&USART2_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&USART3_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&EXTI15_10_IRQHandler                                                 ,
    (VECTOR_TABLE_Type)&RTC_Alarm_IRQHandler                                                 ,
    (VECTOR_TABLE_Type)&USBWakeUp_IRQHandler                                                 ,
    (VECTOR_TABLE_Type)&TIM8_BRK_IRQHandler                                                  ,
    (VECTOR_TABLE_Type)&TIM8_UP_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&TIM8_TRG_COM_IRQHandler                                              ,
    (VECTOR_TABLE_Type)&TIM8_CC_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&LPTIM1_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&SPI3_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&UART4_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&TIM6_DAC_IRQHandler                                                  ,
    (VECTOR_TABLE_Type)&TIM7_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)&DMA2_Channel1_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA2_Channel2_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA2_Channel3_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA2_Channel4_IRQHandler                                             ,
    (VECTOR_TABLE_Type)&DMA2_Channel5_IRQHandler                                             ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&UCPD1_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)&COMP1_2_3_IRQHandler                                                 ,
    (VECTOR_TABLE_Type)&COMP4_IRQHandler                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&CRS_IRQHandler                                                       ,
    (VECTOR_TABLE_Type)&SAI1_IRQHandler                                                      ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&FPU_IRQHandler                                                       ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&RNG_IRQHandler                                                       ,
    (VECTOR_TABLE_Type)&LPUART1_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&I2C3_EV_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&I2C3_ER_IRQHandler                                                   ,
    (VECTOR_TABLE_Type)&DMAMUX_OVR_IRQHandler                                                ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&DMA2_Channel6_IRQHandler                                             ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)0                                                                     ,
    (VECTOR_TABLE_Type)&CORDIC_IRQHandler                                                    ,
    (VECTOR_TABLE_Type)&FMAC_IRQHandler
};
#if defined(__GNUC__)
#pragma GCC diagnostic pop
#endif

